CSI API ETABS v1
eDiaphragmOption Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eDiaphragmOption
Public Enumeration eDiaphragmOption
Dim instance As eDiaphragmOption
public enum class eDiaphragmOption
type eDiaphragmOption
Members
Member name | Value | Description
Disconnect | 1
FromShellObject | 2
DefinedDiaphragm | 3
See Also
Reference
ETABSv1 Namespace